In [1]:
import pandas as pd

In [2]:
dates=pd.date_range('20190301',periods=6)
dates

DatetimeIndex(['2019-03-01', '2019-03-02', '2019-03-03', '2019-03-04',
               '2019-03-05', '2019-03-06'],
              dtype='datetime64[ns]', freq='D')

In [3]:
import numpy as np
df=pd.DataFrame(np.random.randn(6,4),index=dates,columns=['A','B','C','D'])
df

                   A         B         C         D
2019-03-01 -1.467064  0.509130  0.457641 -0.031486
2019-03-02  1.828764 -0.424202 -0.117334  0.340008
2019-03-03  0.131976  0.273559 -0.500310 -1.620814
2019-03-04 -0.626499  0.688591 -0.878404  1.295627
2019-03-05  0.067255  0.567746 -0.465503 -2.553162
2019-03-06  0.690139  0.121531 -1.196178  0.497333

In [4]:
type(df)

pandas.core.frame.DataFrame

In [5]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [6]:
df.index

DatetimeIndex(['2019-03-01', '2019-03-02', '2019-03-03', '2019-03-04',
               '2019-03-05', '2019-03-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df.values

array([[-1.46706439,  0.50913015,  0.45764138, -0.03148589],
       [ 1.82876361, -0.42420215, -0.11733385,  0.34000784],
       [ 0.13197602,  0.2735592 , -0.5003097 , -1.62081419],
       [-0.62649852,  0.68859147, -0.87840424,  1.2956265 ],
       [ 0.06725547,  0.56774607, -0.465503  , -2.55316166],
       [ 0.69013876,  0.12153106, -1.19617846,  0.49733314]])

In [8]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.104095  0.289393 -0.450015 -0.345416
std    1.124489  0.405653  0.579235  1.447231
min   -1.467064 -0.424202 -1.196178 -2.553162
25%   -0.453060  0.159538 -0.783881 -1.223482
50%    0.099616  0.391345 -0.482906  0.154261
75%    0.550598  0.553092 -0.204376  0.458002
max    1.828764  0.688591  0.457641  1.295627

In [9]:
df.sort_values(by='A')

                   A         B         C         D
2019-03-01 -1.467064  0.509130  0.457641 -0.031486
2019-03-04 -0.626499  0.688591 -0.878404  1.295627
2019-03-05  0.067255  0.567746 -0.465503 -2.553162
2019-03-03  0.131976  0.273559 -0.500310 -1.620814
2019-03-06  0.690139  0.121531 -1.196178  0.497333
2019-03-02  1.828764 -0.424202 -0.117334  0.340008

In [10]:
df.sort_values(by='A',ascending=False)

                   A         B         C         D
2019-03-02  1.828764 -0.424202 -0.117334  0.340008
2019-03-06  0.690139  0.121531 -1.196178  0.497333
2019-03-03  0.131976  0.273559 -0.500310 -1.620814
2019-03-05  0.067255  0.567746 -0.465503 -2.553162
2019-03-04 -0.626499  0.688591 -0.878404  1.295627
2019-03-01 -1.467064  0.509130  0.457641 -0.031486

In [11]:
df['A']

2019-03-01   -1.467064
2019-03-02    1.828764
2019-03-03    0.131976
2019-03-04   -0.626499
2019-03-05    0.067255
2019-03-06    0.690139
Freq: D, Name: A, dtype: float64

In [12]:
type(df['A'])

pandas.core.series.Series

In [13]:
df[0:3]

                   A         B         C         D
2019-03-01 -1.467064  0.509130  0.457641 -0.031486
2019-03-02  1.828764 -0.424202 -0.117334  0.340008
2019-03-03  0.131976  0.273559 -0.500310 -1.620814

In [14]:
df.loc['2019-03-01']

A   -1.467064
B    0.509130
C    0.457641
D   -0.031486
Name: 2019-03-01 00:00:00, dtype: float64

In [15]:
df.loc['2019-03-01',['A']]

A   -1.467064
Name: 2019-03-01 00:00:00, dtype: float64

In [16]:
df.loc['2019-03-01',['A','B']]

A   -1.467064
B    0.509130
Name: 2019-03-01 00:00:00, dtype: float64

In [17]:
df.loc['2019-03-01':'2019-03-02',['A','B']]

                   A         B
2019-03-01 -1.467064  0.509130
2019-03-02  1.828764 -0.424202

In [18]:
df.loc[:,['A','B']]

                   A         B
2019-03-01 -1.467064  0.509130
2019-03-02  1.828764 -0.424202
2019-03-03  0.131976  0.273559
2019-03-04 -0.626499  0.688591
2019-03-05  0.067255  0.567746
2019-03-06  0.690139  0.121531

In [19]:
df.iloc[0:2]

                   A         B         C         D
2019-03-01 -1.467064  0.509130  0.457641 -0.031486
2019-03-02  1.828764 -0.424202 -0.117334  0.340008

In [20]:
df.iloc[0:2, 0:2]

                   A         B
2019-03-01 -1.467064  0.509130
2019-03-02  1.828764 -0.424202

In [21]:
df.iloc[[0,1,3],0:2]

                   A         B
2019-03-01 -1.467064  0.509130
2019-03-02  1.828764 -0.424202
2019-03-04 -0.626499  0.688591

In [22]:
df.iloc[[0,1,3]]

                   A         B         C         D
2019-03-01 -1.467064  0.509130  0.457641 -0.031486
2019-03-02  1.828764 -0.424202 -0.117334  0.340008
2019-03-04 -0.626499  0.688591 -0.878404  1.295627

In [23]:
df['A']>0

2019-03-01    False
2019-03-02     True
2019-03-03     True
2019-03-04    False
2019-03-05     True
2019-03-06     True
Freq: D, Name: A, dtype: bool

In [24]:
df[df['A']>0]

                   A         B         C         D
2019-03-02  1.828764 -0.424202 -0.117334  0.340008
2019-03-03  0.131976  0.273559 -0.500310 -1.620814
2019-03-05  0.067255  0.567746 -0.465503 -2.553162
2019-03-06  0.690139  0.121531 -1.196178  0.497333

In [25]:
df>0

                A      B      C      D
2019-03-01  False   True   True  False
2019-03-02   True  False  False   True
2019-03-03   True   True  False  False
2019-03-04  False   True  False   True
2019-03-05   True   True  False  False
2019-03-06   True   True  False   True

In [26]:
df[df>0]

                   A         B         C         D
2019-03-01       NaN  0.509130  0.457641       NaN
2019-03-02  1.828764       NaN       NaN  0.340008
2019-03-03  0.131976  0.273559       NaN       NaN
2019-03-04       NaN  0.688591       NaN  1.295627
2019-03-05  0.067255  0.567746       NaN       NaN
2019-03-06  0.690139  0.121531       NaN  0.497333

In [28]:
df2=pd.DataFrame(df,columns=['A','C','D','B'])
df2

                   A         C         D         B
2019-03-01 -1.467064  0.457641 -0.031486  0.509130
2019-03-02  1.828764 -0.117334  0.340008 -0.424202
2019-03-03  0.131976 -0.500310 -1.620814  0.273559
2019-03-04 -0.626499 -0.878404  1.295627  0.688591
2019-03-05  0.067255 -0.465503 -2.553162  0.567746
2019-03-06  0.690139 -1.196178  0.497333  0.121531

In [29]:
df['E']=np.nan
df

                   A         B         C         D   E
2019-03-01 -1.467064  0.509130  0.457641 -0.031486 NaN
2019-03-02  1.828764 -0.424202 -0.117334  0.340008 NaN
2019-03-03  0.131976  0.273559 -0.500310 -1.620814 NaN
2019-03-04 -0.626499  0.688591 -0.878404  1.295627 NaN
2019-03-05  0.067255  0.567746 -0.465503 -2.553162 NaN
2019-03-06  0.690139  0.121531 -1.196178  0.497333 NaN

In [30]:
df.loc['2019-03-02',['E']]=2
df

                   A         B         C         D    E
2019-03-01 -1.467064  0.509130  0.457641 -0.031486  NaN
2019-03-02  1.828764 -0.424202 -0.117334  0.340008  2.0
2019-03-03  0.131976  0.273559 -0.500310 -1.620814  NaN
2019-03-04 -0.626499  0.688591 -0.878404  1.295627  NaN
2019-03-05  0.067255  0.567746 -0.465503 -2.553162  NaN
2019-03-06  0.690139  0.121531 -1.196178  0.497333  NaN

In [31]:
df['F']=df['A']+df['B']
df

                   A         B         C         D    E         F
2019-03-01 -1.467064  0.509130  0.457641 -0.031486  NaN -0.957934
2019-03-02  1.828764 -0.424202 -0.117334  0.340008  2.0  1.404561
2019-03-03  0.131976  0.273559 -0.500310 -1.620814  NaN  0.405535
2019-03-04 -0.626499  0.688591 -0.878404  1.295627  NaN  0.062093
2019-03-05  0.067255  0.567746 -0.465503 -2.553162  NaN  0.635002
2019-03-06  0.690139  0.121531 -1.196178  0.497333  NaN  0.811670

In [33]:
!pip install xlrd

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: xlrd in c:\users\hckim\appdata\roaming\python\python311\site-packages (2.0.1)

In [34]:
pd.read_excel("./playing_data-master/data/teenage_mental.xls")

,기간,구분,스트레스 인지율,스트레스 인지율.1,스트레스 인지율.2,우울감 경험률,우울감 경험률.1,우울감 경험률.2,자살 생각률,자살 생각률.1,자살 생각률.2
0,기간,구분,전체,남학생,여학생,전체,남학생,여학생,전체,남학생,여학생
1,2018,구분,42.7,34.5,51.5,29.6,24.2,35.4,15.4,11.8,19.2

In [35]:
pd.read_excel("./playing_data-master/data/teenage_mental.xls", header=1)

     기간 구분     전체   남학생   여학생  전체.1  남학생.1  여학생.1  전체.2  남학생.2  여학생.2
0  2018  구분  42.7  34.5  51.5  29.6   24.2   35.4  15.4   11.8   19.2

In [36]:
pd.read_excel("./playing_data-master/data/teenage_mental.xls", header=1, usecols="C:K")

     전체   남학생   여학생  전체.1  남학생.1  여학생.1  전체.2  남학생.2  여학생.2
0  42.7  34.5  51.5  29.6   24.2   35.4  15.4   11.8   19.2

In [37]:
col_names=['스트레스','스트레스남학생','스트레스여학생','우울감경험률','우울남학생','우울여학생','자살생각율','자살남학생','자살여학생']
pd.read_excel("./playing_data-master/data/teenage_mental.xls", header=1, usecols="C:K", names=col_names)

   스트레스  스트레스남학생  스트레스여학생  우울감경험률  우울남학생  우울여학생  자살생각율  자살남학생  자살여학생
0  42.7     34.5     51.5    29.6   24.2   35.4   15.4   11.8   19.2

In [39]:
raw_data=pd.read_excel("./playing_data-master/data/teenage_mental.xls",
                      header=1,
                      usecols="C:K",
                      names=col_names)
raw_data

   스트레스  스트레스남학생  스트레스여학생  우울감경험률  우울남학생  우울여학생  자살생각율  자살남학생  자살여학생
0  42.7     34.5     51.5    29.6   24.2   35.4   15.4   11.8   19.2

In [41]:
raw_data.loc[1]=100.-raw_data.loc[0]
raw_data

   스트레스  스트레스남학생  스트레스여학생  우울감경험률  우울남학생  우울여학생  자살생각율  자살남학생  자살여학생
0  42.7     34.5     51.5    29.6   24.2   35.4   15.4   11.8   19.2
1  57.3     65.5     48.5    70.4   75.8   64.6   84.6   88.2   80.8

In [42]:
raw_data['응답']=['그렇다','아니다']
raw_data

   스트레스  스트레스남학생  스트레스여학생  우울감경험률  우울남학생  우울여학생  자살생각율  자살남학생  자살여학생   응답
0  42.7     34.5     51.5    29.6   24.2   35.4   15.4   11.8   19.2  그렇다
1  57.3     65.5     48.5    70.4   75.8   64.6   84.6   88.2   80.8  아니다

In [43]:
raw_data.set_index('응답', drop=True, inplace=True)
raw_data

     스트레스  스트레스남학생  스트레스여학생  우울감경험률  우울남학생  우울여학생  자살생각율  자살남학생  자살여학생
응답
그렇다  42.7     34.5     51.5    29.6   24.2   35.4   15.4   11.8   19.2
아니다  57.3     65.5     48.5    70.4   75.8   64.6   84.6   88.2   80.8